// // 1 Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

// const string = "eукуцкуц куцкцку ф";
// if (string.length > 1) {
//   console.log(string[string.length - 2]);
// } else {
//   console.log("в строке всего 1 символ");
// }

// // 2 Даны два целых числа. Проверьте, что первое число без остатка делится на второе.
// const num1 = 13;
// const num2 = 5;
// if (num1 % num2 == 0) {
//   console.log("числа делятся без остатка");
// } else {
//   console.log("числа делятся c остатка");
// }

let i = 1;
while (i < 100) {
  console.log(i);
  i++
}
