// // 1 Выведите в консоль все целые числа от 1 до 100.

// let i = 1;
// while (i < 100) {
//   console.log(i);
//   i++;
// }

// // 2 Выведите в консоль все целые числа от -100 до 0.

// let i = -100;
// while (i < 0) {
//   console.log(i);
//   i++;
// }

// 3 Выведите в консоль все целые числа от 100 до 1.

// let i = 100;
// while (i > 1) {
//   console.log(i);
//   i--;
// }

// // 4 Выведите в консоль все четные числа из промежутка от 1 до 100.

// let i = 1;
// while (i < 100) {
//   if (i % 2 === 1) {
//     i++;
//   } else {
//     console.log(i);
//     i++;
//   }
// }

// 5 Выведите в консоль все числа кратные трем в промежутке от 1 до 100.

let i = 1;
while (i < 100) {
  if (i % 3 === 0) {
    console.log(i);
    i++;
  } else {
    i++;
  }
}
